window.__LOGS__ = {
  zh: `# 日志记录

**日**志**记**录，不全、不准、不豚

## 0826-0828
- 初期立项、大纲、缩略图、懒加载等基础功能...
- 风格、配色、排版等外观设计...
- 数据来源决定使用主仓库而非本地构建后推送，顺带使用GitHub的自动工作流完成自动构建和推送。同时使用静态页面，方便直接托管到GitHub Pages
- 自动构建和推送决定使用定时自动触发，而非内容更新时
- 其他细节...

## 0829
- 优化细节
- 初版产出
- 修复原图宽高比错误、图片被挤压
- 修复图片最大缩小值无任何限制
- 添加图片旋转功能
- 添加滑动切换功能
- 修复宽图显示的相关问题
- 删除图片旋转功能
- 修复滑动切换时的异常闪烁
- 修复当图片未填满画面时无法正常触发滑动切换的bug
- 修复滑动切换时有概率出现的“裂图”图标
- 优化滑动切换的触发条件

## 0830
- 新增排序功能
- 新增长图提示
- 修复排序功能的异常表现
- 调整文案、修正翻译
- 托管到 GitHub Pages 测试
- 现在原图会在页面中心显示，而不是紧贴顶部
- 在左下角新增菜单按钮

## 0901
- 修复菜单按钮的隐藏方式
- 尝试调整搜索框的视觉表现
- 调整菜单按钮及弹出列表阴影表现
- 回退对搜索框的调整
- 现在在滑动到页面底部时菜单按钮会重新出现
- 添加页脚信息、调整标签页名称、标题、文案
- 修复顶部分类栏未与标题对齐的bug
- “修复”亮暗主题切换时出现的异常白条闪烁的bug
- 修复电脑端顶栏宽度异常的bug

## 0902
- 尝试使左下角菜单键的风格与顶栏风格匹配
- 调整分类顺序和选中颜色
- 回退对菜单键的调整
- 添加河豚
- 现在原图查看器能够正确被记入标签页历史，可以使用返回键或标签页回退键正常关闭

## 0903
- 亮暗主题现在会读取系统设置自动切换
- 解析到自定义域名、接入Cloudflare
- 配置CDN、WAF...
- 现在图库站被解析到子域名www而非主域名，但主域名会被重定向到子域名
- 申请站初期构思...

## 0904-0917
- 若干小优化
- 调整图库站在Cloudflare的配置
- 重心转向申请站
- ......
- 申请站完成

## 0918-0920
- 重心转向QQBot，计划接入图库...
- ......
- QQBot完成

## 0922
- **全面优化大量控件的交互表现：**阴影、光效、缩放、旋转等
- 重绘原图查看器右上角按钮的SVG图标
- 顶栏底部添加边线
- 页面两侧添加边线，尝试填补“空白”
- 优化河豚彩蛋的表现
- 现在彩蛋触发后顶栏底部的边线会跟随变色和流动
- 标题现在可点击旋转
--大部分改动集中于CSS

## 0923
- **发现在移动端时多项控件的动效无法正确显示、无法正确结束的bug**
- 现在指针双击图片后可以在指针位置放大图片
- SEO优化...
- 删除原图查看器右上角的换张按钮，在页面的两侧添加换张按钮
- 现在换张按钮在切换图片后会以正常透明度显示一段时间，之后大幅降低透明度
- 调整原图查看器中的图片数据在手机端的显示表现
- 现在换张按钮仅在电脑端显示
- 在Q/A弹窗中添加日志按钮

## 0924
- 初步修复查看原图时，鼠标指针会常驻抓手图标的bug，长图仍会出现
- 修复指针进行拖拽移动后原图会被关闭的bug
- 修复指针在弹窗外进行滚轮操作时会隐藏掉Q/A弹窗，但不会隐藏日志弹窗的bug
- 优化切图按钮的透明化表现和逻辑
- 再次调整多个按钮的旋转角度和表现
- **发现指针双击放大功能出现偏移的bug**
- 现在菜单按钮弹出的列表窗口会在失去指针焦点时延迟1秒后自动收回
- 修复切图按钮的异常旋转bug，并且现在受到点击时会正确缩小
- 再次调整菜单按钮的隐藏/弹出的表现
- 菜单列表的选项现在在焦点时会放大，点击时也会缩小，拥有与其他控件一致的动效
- 现在标题文本不会被选中
- 现在原图查看器中的图片不会被选中
- 现在标题在1秒内连续受击6次会进入持续旋转状态，9秒后结束
- 现在语言切换按钮被点击时会表现出“歪头”，与其他按钮风格一致
- 修复原图查看器的抓手显示bug，现在水平方向超出后才会显示抓手，而不是垂直方向
- 尝试修复在原图查看器打开时的初期继续连击会触发指针双击放大功能的bug

## 0925
- 现在相关的Q/A弹窗和日志弹窗会被正确计入标签页历史，使用返回键/标签页回退键可正常关闭弹窗，而不是直接退出
- 现在默认隐藏原生滚动条，可在菜单列表手动开启
- 现在标题会以斜体显示
- 现在缩略图加载中时会持续闪过白色微光
- 修复设备断网时提示窗口的排版异常bug，同时调整了加载中的提示窗口
- 通马桶x2...
- 将日志内容从i18n中剥离
- 现在日志按钮的悬停文本独立了
- 通马桶...
- 帮助孤儿变量寻亲...
- 调整菜单按钮的隐藏条件
- 现在在原图查看器中双击空白处不会再触发双击放大功能
- 现在图块为焦点时散发的辉光不会被顶栏遮挡
- 初步修复标签页历史回退问题。未彻底解决
- 初步修复相关弹窗、日志弹窗的标签页历史问题。未彻底解决

## 0926

`
};